gdgly/NUC97X_JS/STM32F4xx/DL698/RM_TxDATA_DL698.cpp
			return 0;
		default:
			return 0;
	}
	
//时间标签
	p8tx[Byte]=0;
	Byte+=1;
//安全模式读取
	p8tx-=3;//空出的3字节
	x=Byte-14;//APDU长度
	i=(p8CSD[2]<<8)|p8CSD[3];
	i=RM_SECURITY(i);//抄表安全模式字,入口:OI,出口:(同安全请求)b7=0无安全=1安全传输,b6=0明文=1密文,b5=,b4=,b3-b0=0数据验证码[0]SID_MAC =1随机数[1]RN =2随机数+数据MAC[2]RN_MAC =3安全标识[3]SID
	if(i==0)
	{//明文读取
		for(i=0;i<x;i++)
		{
			p8tx[14+i]=p8tx[17+i];
		}
	}
	else
	{//明文+数据验证码读取
	#if RM_SECURITY_MeterNo==0//0=否,1=是;DL698安全模式抄表时先抄读电能表表号(电能表表号用于计校验码)
		UARTCtrl->RM_Rx_date_40020200[0]=2;//抄表接收到的数据用于MAC验证的电能表表号;0th=状态(0=空,1=正在抄,2=完成),1th=表号长度(<=6),2th-7th表号值
	#else
		if((((UARTCtrl->TaskID>>20)&0xf)==5)&&(Terminal_Router->MinuteCollect==1))
			UARTCtrl->RM_Rx_date_40020200[0]=2;
	#endif
		if(UARTCtrl->RM_Rx_date_40020200[0]!=2)//抄表接收到的数据用于MAC验证的电能表表号;0th=状态(0=空,1=正在抄,2=完成),1th=表号长度(<=6),2th-7th表号值
		{//先用明文读电能表表号
			UARTCtrl->RM_Rx_date_40020200[0]=1;//抄表接收到的数据用于MAC验证的电能表表号;0th=状态(0=空,1=正在抄,2=完成),1th=表号长度(<=6),2th-7th表号值
			p8tx[14]=5;//GET-Request
			p8tx[15]=1;//读取一个对象属性请求             [1] GetRequestNormal
			p8tx[16]=UARTCtrl->PIID&0x3f;//PIID
			Byte=17;
			//OAD
			p8CSD[1]=0x00;
			p8CSD[2+0]=(RM_SECURITY_MeterNo_OAD>>24)&0xff;//电能表表号 或 电能表ESAM序列号
			p8CSD[2+1]=(RM_SECURITY_MeterNo_OAD>>16)&0xff;
			p8CSD[2+2]=(RM_SECURITY_MeterNo_OAD>>8)&0xff;
			p8CSD[2+3]=RM_SECURITY_MeterNo_OAD&0xff;
			for(i=0;i<4;i++)
			{
				p8tx[Byte+i]=p8CSD[2+i];
			}
			Byte+=4;
		//时间标签
			p8tx[Byte]=0;
			Byte+=1;
		//帧校验FCS  2Byte(是对整帧除起始字符、结束字符和FCS本身之外的所有字节的校验)
		//结束字符（16H）
			Byte+=3;
			Byte-=2;
			p8tx[1]=Byte;
			p8tx[2]=Byte>>8;
			Uart_698_HCSFCS(p8tx);//整帧校验计算(HCS和FCS),同时加结束0x16;返回0=正确，1=错误
			return Byte+2;
		}
		p8tx[14]=0x10;
		p8tx[15]=0;//明文应用数据单元 [0] 密文应用数据单元 [1]
		p8tx[16]=x;//octet-string长度
		Byte+=3;
		p8tx[Byte]=1;//随机数 [1]  RN
		p8tx[Byte+1]=16;//长度
		Byte+=2;
		i=TESAM_CMD_TxRx(0x80040010,0,0);//发送ESAM命令;返回:0=正确发收且返回9000,1=错误
		if(i)
		{
			UART7Ctrl->Task=0;//关电源重启
		}
		MR((u32)p8tx+Byte,ADDR_UART7Rx+5,16);
		MR((u32)&UARTCtrl->Rand,ADDR_UART7Rx+5,16);//抄表安全模式时发送给电表的16字节随机数
		Byte+=16;
	}
//帧校验FCS  2Byte(是对整帧除起始字符、结束字符和FCS本身之外的所有字节的校验)
//结束字符（16H）
	Byte+=3;
	Byte-=2;
	p8tx[1]=Byte;
	p8tx[2]=Byte>>8;
	Uart_698_HCSFCS(p8tx);//整帧校验计算(HCS和FCS),同时加结束0x16;返回0=正确，1=错误
	return Byte+2;
}

/*
u32 RM_TxDATA_DL698(u32 PORTn,u8 *p8CSD,u8 *p8tx)//抄表发送帧;入口:p8CSD=需发送的CSD指针,p8tx=发送缓冲指针;返回:组帧后总长度字节数
{
	u32 i;
	u32 x;
	u32 Byte;
	UARTCtrl_TypeDef * UARTCtrl;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
//起始字符（68H）  1Byte
	p8tx[0]=0x68;
//长度域L  2Byte(除起始字符和结束字符之外的帧字节数)
//控制域C  1Byte
	p8tx[3]=0x43;
//地址域A
	p8tx[4]=5;
	p8tx[5]=UARTCtrl->RMAddr[2]>>8;
	p8tx[6]=UARTCtrl->RMAddr[2];
	p8tx[7]=UARTCtrl->RMAddr[1]>>8;
	p8tx[8]=UARTCtrl->RMAddr[1];
	p8tx[9]=UARTCtrl->RMAddr[0]>>8;
	p8tx[10]=UARTCtrl->RMAddr[0];
//客户机地址CA  1Byte
	p8tx[11]=0;
//帧头校验HCS  2Byte(帧头校验HCS为2字节，是对帧头部分除起始字符和HCS本身之外的所有字节的校验)
//APDU
	i=UARTCtrl->TaskID;
	switch((i>>8)&0xff)//任务号
	{
		case RMTASKnoPOWER://停上电事件固定任务号
			p8tx[14]=5;//GET-Request
			p8tx[15]=1;//读取一个对象属性请求             [1] GetRequestNormal
			UARTCtrl->PIID++;
			p8tx[16]=UARTCtrl->PIID&0x3f;//PIID
			Byte=17;
			//OAD
			for(i=0;i<4;i++)
			{
				p8tx[Byte+i]=p8CSD[2+i];
			}
			Byte+=4;
		//时间标签
			p8tx[Byte]=0;
		//帧校验FCS  2Byte(是对整帧除起始字符、结束字符和FCS本身之外的所有字节的校验)
		//结束字符（16H）
			Byte+=4;
			
			Byte-=2;
			p8tx[1]=Byte;
			p8tx[2]=Byte>>8;
			Uart_698_HCSFCS(p8tx);//整帧校验计算(HCS和FCS),同时加结束0x16;返回0=正确，1=错误
			return Byte+2;
			
//			//05 03 0E 31 0F 02 00 09 01 03 00 20 22 02 00 00 20 1E 02 00 00 20 20 02 00 00
//			p8tx[14]=5;//GET-Request
//			p8tx[15]=3;//读取一个记录型对象属性请求       [3] GetRequestRecord
//			UARTCtrl->PIID++;
//			p8tx[16]=UARTCtrl->PIID&0x3f;//PIID
//			Byte=17;
//			//OAD
//			for(i=0;i<4;i++)
//			{
//				p8tx[Byte+i]=p8CSD[2+i];
//			}
//			Byte+=4;
//			//选择方法
//			p8tx[Byte]=9;//RSD， 选择方法9:Selector9为指定选取上第n次记录
//			p8tx[Byte+1]=UARTCtrl->RM_DI_N;//上第n次记录  unsigned
//			Byte+=2;
//			//RCSD，SEQUENCE OF个数
//			p8tx[Byte]=0;//当无一个OAD时，RCSD=0，即SEQUENCE OF的数据项个数为0，表示“不选择（即全选）”
//			Byte++;
//		//时间标签
//			p8tx[Byte]=0;
//		//帧校验FCS  2Byte(是对整帧除起始字符、结束字符和FCS本身之外的所有字节的校验)
//		//结束字符（16H）
//			Byte+=4;
//			
//			Byte-=2;
//			p8tx[1]=Byte;
//			p8tx[2]=Byte>>8;
//			Uart_698_HCSFCS(p8tx);//整帧校验计算(HCS和FCS),同时加结束0x16;返回0=正确，1=错误
//			return Byte+2;
		default:
			break;
	}
	switch((i>>24)&0xf)//方案类型
	{
		case 1://普通采集方案
			p8tx[14]=5;//GET-Request
			if(p8CSD[1]==0)
			{//OAD
				p8tx[15]=1;//读取一个对象属性请求             [1] GetRequestNormal
				UARTCtrl->PIID++;
				p8tx[16]=UARTCtrl->PIID&0x3f;//PIID
				Byte=17;
				for(i=0;i<4;i++)
				{
					p8tx[Byte+i]=p8CSD[2+i];
				}
				Byte+=4;
			}
			else
			{//ROAD
				p8tx[15]=3;//读取一个记录型对象属性请求       [3] GetRequestRecord
				UARTCtrl->PIID++;
				p8tx[16]=UARTCtrl->PIID&0x3f;//PIID
				Byte=17;
				//OAD
				for(i=0;i<4;i++)
				{
					p8tx[Byte+i]=p8CSD[2+i];
				}
				Byte+=4;
				switch((UARTCtrl->TaskID>>20)&0xf)//采集类型
				{
					default:
					case 0://0=采集当前数据
		//				p8tx[Byte]=0;//RSD， 选择方法0:不选择       [0]  NULL
		//				Byte+=1;
		//				break;
					case 1://1=采集上第N次
						p8tx[Byte]=9;//RSD， 选择方法9:Selector9为指定选取上第n次记录
						p8tx[Byte+1]=UARTCtrl->RM_DI_N;//上第n次记录  unsigned
						Byte+=2;
						break;
					case 2://2=按冻结时标采集
						p8tx[Byte]=1;//RSD， 选择方法1
						p8tx[Byte+1]=0x20;//OAD，数据冻结时间
						p8tx[Byte+2]=0x21;
						p8tx[Byte+3]=0x02;
						p8tx[Byte+4]=0x00;
						p8tx[Byte+5]=DataType_date_time_s;//date_time_s
						Byte+=6;
						for(i=0;i<4;i++)//时间:年年月日
						{
							p8tx[Byte+i]=Comm_Ram->DL698YMDHMS[i];
						}
						p8tx[Byte+4]=0x00;//时间:时
						p8tx[Byte+5]=0x00;//时间:分
						p8tx[Byte+6]=0x00;//时间:秒
						i=(UARTCtrl->RMCSD[2]<<8)|(UARTCtrl->RMCSD[3]<<0);//采集数据的OI
						switch(i)
						{
							case 0x5004://日冻结
								break;
							case 0x5006://月冻结
								p8tx[Byte+3]=0x01;//固定为1日
								break;
						}
						Byte+=7;
						break;
					case 3://3=按时标间隔采集
						//采曲线数据
						p8tx[Byte]=1;//RSD， 选择方法1
						p8tx[Byte+1]=0x20;//OAD，数据冻结时间
						p8tx[Byte+2]=0x21;
						p8tx[Byte+3]=0x02;
						p8tx[Byte+4]=0x00;
						p8tx[Byte+5]=DataType_date_time_s;//date_time_s
						Byte+=6;
						DateSaveTI(PORTn,p8tx+Byte);//普通采集方案的采集存储时标;返回:pOUT=date_time_s
						Byte+=7;
						break;
					case 4://4=RetryMetering 补抄
						
						break;
				}
				x=p8CSD[6];//RCSD，SEQUENCE OF个数
				p8tx[Byte]=x;
				Byte++;
				for(i=0;i<x;i++)
				{
					p8tx[Byte+0]=0;//类型=OAD
					p8tx[Byte+1]=p8CSD[7+(i*4)+0];//OAD
					p8tx[Byte+2]=p8CSD[7+(i*4)+1];//OAD
					p8tx[Byte+3]=p8CSD[7+(i*4)+2];//OAD
					p8tx[Byte+4]=p8CSD[7+(i*4)+3];//OAD
					Byte+=5;
				}
			}
			break;
		case 2://事件采集方案
			//05 03 0E 31 0F 02 00 09 01 03 00 20 22 02 00 00 20 1E 02 00 00 20 20 02 00 00
			p8tx[14]=5;//GET-Request
			p8tx[15]=3;//读取一个记录型对象属性请求       [3] GetRequestRecord
			UARTCtrl->PIID++;
			p8tx[16]=UARTCtrl->PIID&0x3f;//PIID
			Byte=17;
			//OAD
			for(i=0;i<4;i++)
			{
				p8tx[Byte+i]=p8CSD[2+i];
			}
			Byte+=4;
			//选择方法
			p8tx[Byte]=9;//RSD， 选择方法9:Selector9为指定选取上第n次记录
			p8tx[Byte+1]=1;//上第n次记录  unsigned
			Byte+=2;
			//RCSD，SEQUENCE OF个数
//			p8CSD[5]=0;//RCSD，SEQUENCE OF个数//!!!测试台模拟表不支持SEQUENCE OF个数=0抄表
//			p8tx[Byte]=0;
//			Byte++;
			x=p8CSD[6];//RCSD，SEQUENCE OF个数
			p8tx[Byte]=x;
			Byte++;
			for(i=0;i<x;i++)
			{
				p8tx[Byte+0]=0;//类型=OAD
				p8tx[Byte+1]=p8CSD[7+(i*4)+0];//OAD
				p8tx[Byte+2]=p8CSD[7+(i*4)+1];//OAD
				p8tx[Byte+3]=p8CSD[7+(i*4)+2];//OAD
				p8tx[Byte+4]=p8CSD[7+(i*4)+3];//OAD
				Byte+=5;
			}
			break;
		case 3://透明方案
			
			return 0;
		default:
			return 0;
	}
	
//时间标签
	p8tx[Byte]=0;
//帧校验FCS  2Byte(是对整帧除起始字符、结束字符和FCS本身之外的所有字节的校验)
//结束字符（16H）
	Byte+=4;
	
	Byte-=2;
	p8tx[1]=Byte;
	p8tx[2]=Byte>>8;
	Uart_698_HCSFCS(p8tx);//整帧校验计算(HCS和FCS),同时加结束0x16;返回0=正确，1=错误
	return Byte+2;
}
*/



//698广播校时
//68 1A 00 43 C0 AA 00 5E F7 07 01 00 40 00 7F 00 1C 07 E1 06 05 0A 18 0C 00 EC 67 16
//698广播单地址校时
//地址为 01 00 10 56 93 58
//68 1F 00 43 05 58 93 56 10 00 01 00 17 B6 07 01 00 40 00 7F 00 1C 07 E1 06 05 0A 33 1A 00 30 8C 16

u32 BroadcastTime_TxDATA_DL698(u8 *p8tx)//DL698广播校时发送帧;返回:组帧后总长度字节数
{
	u32 Byte;
	
//起始字符（68H）  1Byte
	p8tx[0]=0x68;
//长度域L  2Byte(除起始字符和结束字符之外的帧字节数)
//控制域C  1Byte
	p8tx[3]=0x43;
//地址域A
	p8tx[4]=0xC0;
	p8tx[5]=0xAA;
//客户机地址CA  1Byte
	p8tx[6]=0;
//帧头校验HCS  2Byte(帧头校验HCS为2字节，是对帧头部分除起始字符和HCS本身之外的所有字节的校验)
//APDU
	p8tx[9]=0x07;
	p8tx[10]=1;
	p8tx[11]=0;//PIID
	p8tx[12]=0x40;//OAD
	p8tx[13]=0x00;
	p8tx[14]=0x7F;
	p8tx[15]=0;
	p8tx[16]=DataType_date_time_s;
	MR((u32)p8tx+17,ADDR_DL698YMDHMS,7);
	Byte=24;
	
//时间标签
	p8tx[Byte]=0;
//帧校验FCS  2Byte(是对整帧除起始字符、结束字符和FCS本身之外的所有字节的校验)
//结束字符（16H）
	Byte+=4;
	
	Byte-=2;
	p8tx[1]=Byte;
	p8tx[2]=Byte>>8;
	Uart_698_HCSFCS(p8tx);//整帧校验计算(HCS和FCS),同时加结束0x16;返回0=正确，1=错误
	return Byte+2;
}








